---
type: WallUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# WallUtils

`Autodesk.Revit.DB.WallUtils` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AllowWallJoinAtEnd | 2012 | `public static void AllowWallJoinAtEnd ( Wall wall , int end )` |
| Method | DisallowWallJoinAtEnd | 2012 | `public static void DisallowWallJoinAtEnd ( Wall wall , int end )` |
| Method | IsWallJoinAllowedAtEnd | 2012 | `public static bool IsWallJoinAllowedAtEnd ( Wall wall , int end )` |